{"Managers":[{"Name":"Time","IsLoad":true,"Des":["Time manager for the program.","管理程序进程的时间系统"],"Rely":[]},{"Name":"Tool","IsLoad":true,"Des":["Tool function ststem for the program.","程序中的一些工具函数系统"],"Rely":[]},{"Name":"Event","IsLoad":true,"Des":["Event system in program.","程序中的事件系统"],"Rely":[]},{"Name":"Https","IsLoad":true,"Des":["The HTTP request system in the program.","程序中的网络HTTP请求系统"],"Rely":[]},{"Name":"Socket","IsLoad":true,"Des":["Socket network system in the program.","程序中的Socket网络系统"],"Rely":[" + Best HTTP (Pro)"]},{"Name":"Folder","IsLoad":true,"Des":["A system used in a program to interact with local files","程序中用来和本地文件做交互的系统"],"Rely":[]},{"Name":"Load","IsLoad":true,"Des":["The system used to load resources in the application can also interact with YooAssets, and the content code is automatically commented when the YooAssets dependency is removed.","程序中用来加载资源的系统，也可以和YooAssets交互，当YooAssets依赖被卸载时，内容代码也会被自动注释"],"Rely":[" + YooAssets"]},{"Name":"Patch","IsLoad":true,"Des":["Patch update manager for the project.","补丁更新管理器"],"Rely":[" + YooAssets"," + Load manager"]},{"Name":"Scenes","IsLoad":true,"Des":["A system used in a program to jump scenes.","程序中用来跳转场景的系统"],"Rely":[" + Load manager"]},{"Name":"Audio","IsLoad":true,"Des":["The system used to play audio in a program.","程序中用来播放音频的系统"],"Rely":[" + Load manager"]},{"Name":"UI","IsLoad":true,"Des":["The user operating interface system in the program.","程序中的用户操作界面系统"],"Rely":[" + Load manager"]}],"ExampleSwitch":true,"Plugins":[{"Name":"Best HTTP (Pro)","IsLoad":true,"Des":["Best HTTP (Pro) is a professional-grade Unity plugin developed by Ortwin Glueck that aims to address the limitations of Unity's native HTTP communications and provide a more stable and efficient networking solution. This plug-in supports a variety of protocols, including HTTP, HTTPS, Websocket, etc., and has multi-threading processing, custom caching policies, compressed transmission and other functions, suitable for various types of network application scenarios, such as real-time data exchange, file download, API call.","Best HTTP (Pro) 是旨在解决Unity原生HTTP通信的局限性，提供更稳定、更高效的网络解决方案。\n\n这款插件支持多种协议，包括HTTP、HTTPS、Websocket等，且具备多线程处理、自定义缓存策略、压缩传输等功能，适用于各种类型的网络应用场景，如实时数据交换、文件下载、API调用等"]},{"Name":"YooAsset","IsLoad":true,"Des":["YooAsset is a resource management system for Unity3D that helps R&D teams deploy and deliver games quickly.\nIt can meet the various needs of commercial games, and has been proven by multiple million DAU games.","YooAsset是一套用于Unity3D的资源管理系统，用于帮助研发团队快速部署和交付游戏。\n\n它可以满足商业化游戏的各类需求，并且经历多款百万DAU游戏产品的验证。"]},{"Name":"Joystick","IsLoad":true,"Des":["This is a UGUI-based Joystick component with minimal code but relatively complete functionality.","这是一个代码极简但功能相对完善的基于UGUI的摇杆（Joystick）组件。"]},{"Name":"TextMesh Pro","IsLoad":true,"Des":["TextMeshPro is Unity's ultimate text solution. It is a perfect alternative to Unity UI Text and the older version of Text Mesh.\nPowerful and easy to use TextMeshPro (also known as TMP) uses advanced text rendering techniques along with a set of custom shaders; It dramatically improves visual quality while giving users incredible flexibility to create text styles and textures.","TextMeshPro 是Unity的最终文本解决方案。它是Unity UI Text和旧版Text Mesh的完美替代方案。\n\n功能强大且易于使用的 TextMeshPro（也称为 TMP）使用高级文本渲染技巧以及一组自定义着色器；它大幅改进了视觉质量，同时为用户创建文本样式和纹理提供了难以置信的灵活度。"]}]}